# Pandas DataFrame Oluşturma

In [1]:
import pandas as pd

In [3]:
l = [2,56,32,48,85]

In [4]:
l

[2, 56, 32, 48, 85]

In [10]:
pd.DataFrame(l, columns = ["degisken_ismi"])  #Sütun isimlendirme

   degisken_ismi
0              2
1             56
2             32
3             48
4             85

In [6]:
import numpy as np

In [7]:
m = np.arange(1,10).reshape((3,3))

In [8]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [11]:
pd.DataFrame(m, columns = ["var1", "var2","var3"]) #2 boyutta sütun isimlendirme

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [12]:
#df isimlendime

In [14]:
df = pd.DataFrame(m, columns = ["var1", "var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [17]:
df.columns =("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [18]:
#özellik bilgisi

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [22]:
df.size

9

In [23]:
df.shape

(3, 3)

In [24]:
df.ndim

2

In [25]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [29]:
a = np.array([1,2,3,4,5])
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

# Eleman İşlemleri

In [30]:
s1 = np.random.randint(10, size =5)
s2 = np.random.randint(10, size =5)
s3 = np.random.randint(10, size =5)

In [32]:
sozluk = {"var1": s1, "var2":s2, "var3": s3}

In [33]:
sozluk

{'var1': array([2, 5, 2, 2, 0]),
 'var2': array([7, 1, 2, 0, 6]),
 'var3': array([5, 9, 9, 2, 4])}

In [34]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     2     7     5
1     5     1     9
2     2     2     9
3     2     0     2
4     0     6     4

In [35]:
df[0:1]

   var1  var2  var3
0     2     7     5

In [36]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [38]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     2     7     5
b     5     1     9
c     2     2     9
d     2     0     2
e     0     6     4

In [39]:
df["a":"b"]

   var1  var2  var3
a     2     7     5
b     5     1     9

In [40]:
#silme

In [45]:
df.drop("a",axis =0)

   var1  var2  var3
b     5     1     9
c     2     2     9
d     2     0     2
e     0     6     4

In [44]:
df  #sadece drop işlemi ile geçici silme

   var1  var2  var3
a     2     7     5
b     5     1     9
c     2     2     9
d     2     0     2
e     0     6     4

In [56]:
#inplace = True ekleyerek kalıcı silebiliriz

In [57]:
#fancy

In [59]:
l = ["c","e"]

In [60]:
df.drop(l,axis = 0)

   var1  var2  var3
b     5     1     9
d     2     0     2

In [62]:
l = ["var1","var2","var4"]

In [63]:
for i in l:
    print(i in df)

True
True
False

In [64]:
df

   var1  var2  var3
b     5     1     9
c     2     2     9
d     2     0     2
e     0     6     4

In [65]:
df ["var1"]

b    5
c    2
d    2
e    0
Name: var1, dtype: int32

In [70]:
df ["var4"] = df ["var1"] * df ["var2"]

In [71]:
df

   var1  var2  var3  var4
b     5     1     9     5
c     2     2     9     4
d     2     0     2     0
e     0     6     4     0

In [68]:
# değişken silme

In [74]:
df.drop("var4", axis = 1 )

   var1  var2  var3
b     5     1     9
c     2     2     9
d     2     0     2
e     0     6     4

In [75]:
df

   var1  var2  var3  var4
b     5     1     9     5
c     2     2     9     4
d     2     0     2     0
e     0     6     4     0

In [76]:
df.drop("var4", axis = 1 , inplace = True)

In [77]:
df

   var1  var2  var3
b     5     1     9
c     2     2     9
d     2     0     2
e     0     6     4

In [78]:
l = ["var1", "var2"]
df.drop(l, axis = 1)

   var3
b     9
c     9
d     2
e     4

In [79]:
df

   var1  var2  var3
b     5     1     9
c     2     2     9
d     2     0     2
e     0     6     4